app/Models/AccountModel.php

SELECT *
FROM `data_user`
---
    public function getData(){
        $query = $this -> db -> table('data_user')
        -> get()->getResultArray();