app/Models/CategoryModel.php

    public function getData(){
        $query = $this -> db -> table('data_category')
        -> get()->getResultArray();
---
SELECT *
FROM `data_category`