app/Models/ContactModel.php

    public function getData(){
        $query = $this -> db -> table('data_contact')
        -> get()->getResultArray();
---
SELECT *
FROM `data_contact`