app/Models/ProductModel.php

    public function getData(){
        $query = $this -> db -> table('data_product')
        -> join('data_category', 'data_category.category_id = data_product.category_id')
        -> get()->getResultArray();
---
SELECT *
FROM `data_product`
JOIN `data_category` ON `data_category`.`category_id` = `data_product`.`category_id`

    public function getFewData(){
        $query = $this -> db -> table('data_product')
        -> join('data_category', 'data_category.category_id = data_product.category_id')
        -> limit(6)
        -> get()->getResultArray();
---
SELECT *
FROM `data_product`
JOIN `data_category` ON `data_category`.`category_id` = `data_product`.`category_id`
 LIMIT 6